#!/usr/bin/ruby
# -*- coding: utf-8 -*-
#$KCODE='UTF8'
Encoding.default_external = "UTF-8"
# Encoding.default_internal = "UTF-8"

require 'minitest/autorun' # Minitest ライブラリを読み込む
require_relative './jma_csv_transform' # テストしたいファイルを読み込む

class JmaCdvTransformTest < Minitest::Test # JmaCdvTransformTest クラスを定義、Minitest::Test クラスを継承

	def test_jma_csv_transform
		inputFile = '/Users/hatanaka/Documents/jma_data/2025-08-03_飛島の気候と植物/csv_unused/data-51.csv'
		aJma_csv = Jma_csv.new(inputFile)

# aJma_csv.headerRowEnd の結果が 3 と等しいことを確認
		assert_equal 3, aJma_csv.headerRowEnd()
# aJma_csv.ymdColEnd の結果が 1 と等しいことを確認
		assert_equal 1, aJma_csv.ymdColEnd()
		aJma_csv.compositData()

		assert_equal %Q{[["2024", "7"], ["2024", "8"], ["2024", "9"], ["2024", "10"], ["2024", "11"], ["2024", "12"], ["2025", "1"], ["2025", "2"], ["2025", "3"], ["2025", "4"], ["2025", "5"], ["2025", "6"], ["2025", "7"], ["2025", "8"]]}, aJma_csv.dataYmdAry()
		assert_equal %Q{["start_y", "start_m"]}, aJma_csv.headersYmdAry()
		assert_equal %Q{["最高気温", "最高気温_品質", "最高気温_均質", "日平均気温25℃以上日数", "日平均気温25℃以上日数_品質", "日平均気温25℃以上日数_均質", "降水量", "降水量_現象なし", "降水量_品質", "降水量_均質", "日照時間", "日照時間_現象なし", "日照時間_品質", "日照時間_均質", "平均風速", "平均風速_品質", "平均風速_均質", "日最大風速10m/s以上日数", "日最大風速10m/s以上日数_品質", "日最大風速10m/s以上日数_均質", "最高気温", "最高気温_品質", "最高気温_均質", "日平均気温25℃以上日数", "日平均気温25℃以上日数_品質", "日平均気温25℃以上日数_均質", "降水量", "降水量_現象なし", "降水量_品質", "降水量_均質", "日照時間", "日照時間_現象なし", "日照時間_品質", "日照時間_均質", "平均風速", "平均風速_品質", "平均風速_均質", "日最大風速10m/s以上日数", "日最大風速10m/s以上日数_品質", "日最大風速10m/s以上日数_均質", "最高気温", "最高気温_品質", "最高気温_均質", "日平均気温25℃以上日数", "日平均気温25℃以上日数_品質", "日平均気温25℃以上日数_均質", "降水量", "降水量_品質", "降水量_均質", "日照時間", "日照時間_品質", "日照時間_均質", "平均風速", "平均風速_品質", "平均風速_均質", "日最大風速10m/s以上日数", "日最大風速10m/s以上日数_品質", "日最大風速10m/s以上日数_均質", "最高気温", "最高気温_品質", "最高気温_均質", "日平均気温25℃以上日数", "日平均気温25℃以上日数_品質", "日平均気温25℃以上日数_均質", "降水量", "降水量_現象なし", "降水量_品質", "降水量_均質", "日照時間", "日照時間_現象なし", "日照時間_品質", "日照時間_均質", "平均風速", "平均風速_品質", "平均風速_均質", "日最大風速10m/s以上日数", "日最大風速10m/s以上日数_品質", "日最大風速10m/s以上日数_均質", "最高気温", "最高気温_品質", "最高気温_均質", "日平均気温25℃以上日数", "日平均気温25℃以上日数_品質", "日平均気温25℃以上日数_均質", "降水量", "降水量_品質", "降水量_均質", "日照時間", "日照時間_品質", "日照時間_均質", "平均風速", "平均風速_品質", "平均風速_均質", "日最大風速10m/s以上日数", "日最大風速10m/s以上日数_品質", "日最大風速10m/s以上日数_均質"]}, aJma_csv.headersObsrvAry()





	end #test_jma_csv_transform
end #class

